In [7]:
import pandas as pd
import numpy as np

In [13]:
miaserie = pd.Series([4, 5, 6.5, 7],index=['primo','secondo','terzo','quarto'])
miaserie
print(miaserie['secondo'])

5.0

In [15]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), #serie: strutt dati omogenea
   ....:      'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [16]:
d['two']+d['one']

a    2.0
b    4.0
c    6.0
d    NaN
dtype: float64

In [21]:
ser1 = pd.Series([1, 2, 3], index=['b', 'a', 'c'])
ser2 = pd.Series([1, 2, 3], index=['a', 'b', 'd'])
ser1 + ser2 #somma gli indici, dove index non presente mette NaN (nullo)

a    3.0
b    3.0
c    NaN
d    NaN
dtype: float64

In [22]:
df = pd.DataFrame(d)

In [23]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [24]:
df['one'] # select by column

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [25]:
df['one']['a']

1.0

In [27]:
df.loc['b'] # select by row label

one    2.0
two    2.0
Name: b, dtype: float64

In [28]:
df.iloc[2] # select by row index

one    3.0
two    3.0
Name: c, dtype: float64

In [33]:
df2 = pd.DataFrame(np.random.rand(5,80))
print(df2)

         0         1         2         3         4         5         6   \
0  0.646127  0.548970  0.268951  0.808461  0.016683  0.014053  0.052033
1  0.409455  0.976651  0.824196  0.951940  0.895509  0.735764  0.603634
2  0.910313  0.112414  0.729188  0.193512  0.110309  0.223972  0.841004
3  0.644635  0.855137  0.407439  0.876810  0.785062  0.674765  0.693297
4  0.529667  0.896260  0.513628  0.526910  0.702960  0.882114  0.067643

         7         8         9   ...        70        71        72        73  \
0  0.084838  0.494624  0.825371  ...  0.478158  0.470431  0.883751  0.342571
1  0.543369  0.705625  0.209135  ...  0.605644  0.885584  0.338813  0.123891
2  0.644774  0.837998  0.808713  ...  0.298656  0.959898  0.199228  0.636856
3  0.657330  0.332971  0.904639  ...  0.689706  0.342264  0.727234  0.110487
4  0.480229  0.072964  0.900047  ...  0.692290  0.426240  0.896656  0.598892

         74        75        76        77        78        79
0  0.294011  0.666198  0.559797  0.735224  0.949951  0.962256
1  0.429194  0.792545  0.212184  0.252959  0.361938  0.225877
2  0.537436  0.917009  0.332496  0.159406  0.409822  0.075421
3  0.490476  0.440006  0.037842  0.558869  0.925828  0.044500
4  0.833821  0.462954  0.954584  0.686412  0.455401  0.743764

[5 rows x 80 columns]

In [35]:
df2[2]

0    0.268951
1    0.824196
2    0.729188
3    0.407439
4    0.513628
Name: 2, dtype: float64

In [37]:
df.loc[(df['one']>1) & (df['two']<3)]

   one  two
b  2.0  2.0

In [38]:
df.loc[df['one']>1] # select row conditional SELECT * FROM DF WHERE ONE > 1

   one  two
b  2.0  2.0
c  3.0  3.0

In [39]:
df[df['one']>1] # same as before but shorter

   one  two
b  2.0  2.0
c  3.0  3.0

In [40]:
df[df['one']>1]['two'] # SELECT TWO FROM DF WHERE ONE > 1

b    2.0
c    3.0
Name: two, dtype: float64

In [41]:
#Transpose
df[:].T

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0